"""
Айнымалының атауының құрылымы:
Айнымалының атауы әріптен немесе асты сызу (_) таңбасынан басталуы керек.
Айнымалы атауы санмен басталмайды.
Айнымалы атауында тек әріптер (латын алфавиті), сандар және асты сызу таңбасы ғана қолданылуы керек.
Басқа символдар (мысалы, @, $, %) қолдануға болмайды.
"""
"""san = 5
name = 'Bekzhan'
surname = 'Nurallin'
print(san)
"""
"""
Python тілінде бас әріптер мен кіші әріптерді ажыратады. 
Сондықтан Age және age — екі түрлі айнымалы болып саналады.
"""
# student_zhasy = 17
# print(student_zhasy)


"""
Python тіліндегі түйінді сөздер мен арнайы функция атауларын айнымалы ретінде қолданбаған жөн. 
Олар тілдің бөлігі болғандықтан, басқа мақсатта қолдану қателікке алып келеді.
"""
#def, if, elif,else, print,for,while,type
