"""
Екі айнымалы жасаңыз: сан1 және сан2. Оларға кез келген мәндерді беріңіз.
Екі санды қосып, нәтижесін экранға шығарыңыз
"""
"""a = 5
b = 2
print(a + b)
"""


"""
Екі айнымалы жасаңыз: аты және сәлемдесу. Оларға кез келген мәтінді беріңіз.
Екі мәтінді біріктіріп, экранға шығарыңыз
"""
"""name = input("Сенің атың кім?")
salem = 'hello'

print(name + ' ' + salem)
"""


"""
Айнымалы жасаңыз: туылған_жыл (адамның туылған жылы).
Қазіргі жылды пайдаланып, адамның жасын есептеп, нәтижесін экранға шығарыңыз
"""
"""year = int(input("Туған жылың қандай?"))
kazirgi = 2024
print(kazirgi - year)
"""


"""
Үш айнымалы жасаңыз: сан1, сан2, сан3.
Осы сандардың орташа мәнін есептеп, нәтижені экранға шығарыңыз
"""
"""# 5 + 6 + 4 / 3 -> 5.0
a,b,c = 4,5,6
print( (a + b + c) // 3)
"""



"""
Айнымалы жасаңыз: радиус (шардың радиусы).
Пи мәнін (π) 3.14 деп алыңыз.
Шардын ұзындығын табу формуласы: 
𝐶 = 2 × 𝜋 × радиус
Нәтижені экранға шығарыңыз
"""
"""radius = 3
pi = 3.14
C = 2 * pi * radius
print(C)
"""


"""
Айнымалы жасаңыз: Цельсий (температура Цельсийде).
Формула бойынша Фаренгейтті есептеңіз: 
Фаренгейт=(Цельсий×(9/5))+32.
Нәтижені экранға шығарыңыз
"""
"""celcius = 20
farenheit = celcius * (9/5) + 32
print(farenheit)"""



"""
Айнымалы жасаңыз: негіз және биіктік. Үшбұрыштың ауданын есептеу формуласы:
Ауданы = 1/2 × (негіз × биіктік)
"""
"""negiz = 10
biiktik = 5
audan = 1/2 * (negiz * biiktik)
print(audan)"""



"""

Айнымалы жасаңыз: математика, физика, химия (әр пәннің бағасы). 
Осы пәндердің ұпайларын қосып, орташа бағасын экранға шығарыңыз"""
"""matem = 5
fiz = 5
himia = 5
print((himia + fiz + matem) // 3)
"""

"""
Айнымалы жасаңыз: баға және мөлшер. Осы екеуін көбейтіп, жалпы сомасын экранға шығарыңыз"""

baga = 2000
molsher = 2

print(f'{molsher} килограм гранат бағасы {baga * molsher} тенге')


